Tekla.Structures.AnalysisInternal.DotAnalysisNode
Serialization structure for AnalysisNode.

Tekla.Structures.AnalysisInternal.DotAnalysisNode._AnalysisObject
The analysis object

Tekla.Structures.AnalysisInternal.DotAnalysisNode._CoordinateSystem
The coordinate system of the analysis node.

Tekla.Structures.AnalysisInternal.DotAnalysisNode._Label
The label of the analysis node.

Tekla.Structures.AnalysisInternal.DotAnalysisNode._Position
The position of the analysis node.

Tekla.Structures.AnalysisInternal.DotAnalysisNode._Support
The support of the analysis node.

Tekla.Structures.AnalysisInternal.DotAnalysisNode._IsUserNode
This indicates whether the analysis node is a user node.

Tekla.Structures.AnalysisInternal.DotAnalysisNode._IsUserSupport
This indicates whether the analysis node ha a user node.

Tekla.Structures.AnalysisInternal.DotAnalysisNode.ToStruct(Tekla.Structures.Analysis.AnalysisNode)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisNode.FromStruct(Tekla.Structures.Analysis.AnalysisNode)
DO NOT USE! For internal usage only!
P: P.